#### Terragrunt Plan
<details><summary>Show Plan</summary>

```
time=2026-01-07T03:07:11Z level=info msg=The stack at /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace

Group 2
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base

Group 3
- Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps



Initializing the backend...

Successfully configured the backend "gcs"! OpenTofu will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding rackerlabs/spot versions matching ">= 0.1.0"...
- Installing rackerlabs/spot v0.1.4...
- Installed rackerlabs/spot v0.1.4. Signature validation was skipped due to the registry not containing GPG keys for this provider

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # spot_cloudspace.this will be created
  + resource "spot_cloudspace" "this" {
      + bids                  = (known after apply)
      + cloudspace_name       = "mp-runners-v3"
      + cni                   = "calico"
      + deployment_type       = "gen2"
      + first_ready_timestamp = (known after apply)
      + hacontrol_plane       = false
      + id                    = (known after apply)
      + kubernetes_version    = "1.31.1"
      + last_updated          = (known after apply)
      + name                  = (known after apply)
      + pending_allocations   = (known after apply)
      + region                = "us-central-dfw-1"
      + spotnodepool_ids      = (known after apply)
      + wait_until_ready      = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudspace_name = "mp-runners-v3"
  + node_scaling    = {
      + max = 15
      + min = 2
    }
  + region          = "us-central-dfw-1"
  + server_class    = "gp.vs1.large"

Warning: Deprecated attribute

  on outputs.tf line 15, in output "nodepool_id":
  15:   value       = spot_spotnodepool.this.id

The attribute "id" is deprecated. Refer to the provider documentation for
details.

Error: Invalid value

  with spot_spotnodepool.this,
  on main.tf line 33, in resource "spot_spotnodepool" "this":
  33:   server_class    = var.server_class

The valid values should be read from the serverclasses data source.
time=2026-01-07T03:07:16Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace] 
time=2026-01-07T03:07:16Z level=error msg=Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace has finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo] exit status 1

 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace] 
time=2026-01-07T03:07:16Z level=error msg=Dependency /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace of module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base just finished with an error. Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base will have to return an error too. prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 
time=2026-01-07T03:07:16Z level=error msg=Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base has finished with an error: Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo] exit status 1

 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base] 
time=2026-01-07T03:07:16Z level=error msg=Dependency /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base of module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps just finished with an error. Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps will have to return an error too. prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps] 
time=2026-01-07T03:07:16Z level=error msg=Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps has finished with an error: Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]), finished with an error: Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo] exit status 1

 prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps] 
time=2026-01-07T03:07:16Z level=info msg=
Error: Invalid value

  with spot_spotnodepool.this,
  on main.tf line 33, in resource "spot_spotnodepool" "this":
  33:   server_class    = var.server_class

The valid values should be read from the serverclasses data source.
time=2026-01-07T03:07:16Z level=error msg=tofu invocation failed in /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo prefix=[/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace] 

time=2026-01-07T03:07:16Z level=error msg=3 errors occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo] exit status 1
	* Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo] exit status 1


	* Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/3-argocd-apps (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]), finished with an error: Cannot process module Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/2-cluster-base (excluded: false, assume applied: false, dependencies: [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace]) because one of its dependencies, Module /home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace (excluded: false, assume applied: false, dependencies: []), finished with an error: 1 error occurred:
	* [/home/runner/work/project-beta-runners/project-beta-runners/infrastructure/live/prod/1-cloudspace/.terragrunt-cache/tBcj7gWkR6DzK7fibQr6Z04PngM/ZBpoHMCexMKY2UtDHl6Vn38c9uo] exit status 1




```
</details>